Revit 2027 API
BuiltInFailures.RoomFailures.OptionConflictBoundariesVaryMainAddToOptionSet Property
 Option Conflict between Rooms.\nRoom boundary in the Main Model differs from the apparent boundary in view '[View Name]'.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionConflictBoundariesVaryMainAddToOptionSet { get; }
Public Shared ReadOnly Property OptionConflictBoundariesVaryMainAddToOptionSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionConflictBoundariesVaryMainAddToOptionSet {
	FailureDefinitionId^ get ();
}
static member OptionConflictBoundariesVaryMainAddToOptionSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace